{
  "backend/main.mo": "Motoko canister defining user profiles and daily fitness entries with access control, storage mixins, and CRUD operations including date-based comparisons.",
  "feature_evidence.json": "Feature evidence report describing a specific CalendarView heading update and its associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten short summaries of all major frontend files describing UI behavior, data flow, and feature responsibilities.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH-based light/dark theme variables and global base styles.",
  "frontend/index.html": "HTML entry point loading the React app root and main script with dark mode preset.",
  "frontend/src/App.tsx": "Top-level app component handling authentication, profile setup flow, theming, and global toast configuration.",
  "frontend/src/components/AboutView.tsx": "About page component presenting feature descriptions and navigation back action using cards and icons.",
  "frontend/src/components/AnalyticsView.tsx": "Analytics dashboard building charts for weight, body fat, measurements, workout duration, and heatmaps using queried backend data.",
  "frontend/src/components/CalendarView.tsx": "Renders a calendar view that highlights days with saved entries and opens detail or comparison modals on selection.",
  "frontend/src/components/CameraCapture.tsx": "Provides a camera interface with lens preference, zoom handling, error normalization, and photo capture for saving images.",
  "frontend/src/components/compare/CompareDatePickerModal.tsx": "Empty or placeholder file for a date picker modal used in comparison views.",
  "frontend/src/components/compare/CompareSlotHeader.tsx": "Header component for a comparison slot showing date, variance badge, and a button to open a calendar.",
  "frontend/src/components/DayDetailView.tsx": "Displays and edits a day's entry including measurements, workouts, and photos, with camera capture and upload support.",
  "frontend/src/components/MainLayout.tsx": "Defines the main app layout with navigation between calendar, analytics, profile, and about views.",
  "frontend/src/components/PhotoComparisonView.tsx": "Shows side‑by‑side photo comparisons across three selectable dates with variance and date offset calculations.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name, age, gender, and unit preferences, saving via API.",
  "frontend/src/components/ProfileView.tsx": "React component for viewing and editing the user's profile, handling form state, save actions, and logout.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, login state, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend queries and mutations for profiles, entries, and measurements.",
  "frontend/src/index.css": "Tailwind CSS configuration with theming variables, dark mode settings, and custom UI styles including calendar indicators.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login landing page with branding, feature highlights, and a login button using Internet Identity.",
  "frontend/src/utils/cameraErrorMapping.ts": "Normalizes camera-related errors into consistent categories with user-friendly messages and blocking flags.",
  "frontend/src/utils/cameraLensPreference.ts": "Attempts to select a standard rear camera using device heuristics while avoiding problematic environments like Android Chrome PWAs.",
  "frontend/src/utils/pwa.ts": "Provides PWA and environment detection utilities, including checks for installed PWAs and Android Chrome PWAs.",
  "frontend/src/utils/time.ts": "Utility functions for converting dates to and from backend nanosecond timestamps and formatting or comparing dates.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter parsing, session persistence, and safe removal of parameters from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom color tokens, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing app purpose, versioning, and a detailed list of implemented features with IDs, descriptions, and synonyms."
}