{
  "backend/main.mo": "Canister backend defining user profiles and daily entries with access control, storage mixins, and CRUD operations for measurements, workouts, and profile data.",
  "feature_evidence.json": "Feature evidence report mapping a UI update task to affected frontend files, components, test IDs, and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend files including components, hooks, utilities, and styling.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme variables and dark-mode styles applied across the frontend, including base resets and component tokens.",
  "frontend/index.html": "HTML entry point enabling dark mode and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling authentication state, profile setup flow, theme enforcement, and global toasts.",
  "frontend/src/components/AboutView.tsx": "Static informational view explaining app features with cards and navigation back button.",
  "frontend/src/components/AnalyticsView.tsx": "Analytics dashboard computing and rendering weight charts, rolling averages, and workout heatmap data based on backend queries.",
  "frontend/src/components/CalendarView.tsx": "Renders the main calendar, highlights days with saved content, and opens day detail or photo comparison modals.",
  "frontend/src/components/CameraCapture.tsx": "Controls camera startup, lens preference, zoom, and error handling to capture photos for entries.",
  "frontend/src/components/compare/CompareDatePickerModal.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/compare/CompareSlotHeader.tsx": "Header component for comparison slots showing date, relative day offset, and a button to open a date picker.",
  "frontend/src/components/DayDetailView.tsx": "Displays and edits a day's entry including photos, measurements, and workouts, with save and navigation controls.",
  "frontend/src/components/MainLayout.tsx": "Provides the app’s main navigation layout, switching between calendar, analytics, profile, and about views.",
  "frontend/src/components/PhotoComparisonView.tsx": "Shows side‑by‑side photo comparisons for three selected dates with configurable date slots and variance indicators.",
  "frontend/src/components/ProfileSetupModal.tsx": "Collects initial user profile info such as name, age, gender, and units, then saves it to the backend.",
  "frontend/src/components/ProfileView.tsx": "Profile settings UI allowing users to view and update name, age, gender, and units, with save and logout actions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity login, stored identity loading, status tracking, and logout.",
  "frontend/src/hooks/useQueries.ts": "Collection of hooks wrapping backend queries and mutations for user profiles, entries, measurements, workouts, and comparisons.",
  "frontend/src/index.css": "Tailwind base styles plus theme variables, dark mode definitions, calendar indicators, and toast overrides.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login page UI with branding, feature descriptions, and an Internet Identity login button.",
  "frontend/src/utils/cameraErrorMapping.ts": "Converts camera-related errors into normalized categories with user-friendly messages and blocking flags.",
  "frontend/src/utils/cameraLensPreference.ts": "Attempts to select a standard rear camera using device heuristics, with fallbacks and PWA-specific safety checks.",
  "frontend/src/utils/pwa.ts": "Provides functions to detect installed PWA mode and Android Chrome environments for conditional behavior.",
  "frontend/src/utils/time.ts": "Utility functions for converting dates to backend nanosecond time, formatting dates, and calculating day offsets and variances.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and removing URL parameters, supporting both query strings and hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color tokens, extended animations, container settings, and typography/container-query/animate plugins.",
  "project_state.json": "Defines the project's state metadata including schema version, feature summary, and a list of implemented features with IDs, descriptions, and versions."
}