{
  "backend/main.mo": "Motoko canister defining user profiles, daily entries, measurements, workouts, and access-controlled CRUD operations with storage mixins.",
  "feature_evidence.json": "Report listing detected UI feature modifications mapped to affected files and components with confidence scores.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their functionality and recent feature implementations.",
  "frontend/index.css": "Tailwind CSS setup defining OKLCH-based light/dark theme tokens and global background, text, and border styles.",
  "frontend/index.html": "Basic HTML entry point enabling dark mode and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile loading, enforced dark theme, and routing to login or main layout with toasts.",
  "frontend/src/components/AboutView.tsx": "Static informational view describing app features with cards and a back button.",
  "frontend/src/components/AnalyticsView.tsx": "Analytics dashboard generating charts for weight, body fat, measurements, workouts, and rolling averages using fetched query data.",
  "frontend/src/components/CalendarView.tsx": "Renders the main calendar view, mapping entries to dates, showing saved-content indicators, and opening day details or comparison mode.",
  "frontend/src/components/CameraCapture.tsx": "Handles in-app camera access with error handling, zoom, lens preference, and photo capture for entries.",
  "frontend/src/components/compare/CompareDatePickerModal.tsx": "Empty or missing content; file likely intended to implement a date‑picker modal for compare views.",
  "frontend/src/components/compare/CompareSlotHeader.tsx": "Header component showing a selected date, day‑offset badge, and a button to open a calendar for one comparison slot.",
  "frontend/src/components/DayDetailView.tsx": "Displays and edits a single day's entry including photos, measurements, and workouts, with camera integration.",
  "frontend/src/components/MainLayout.tsx": "Provides the app's top-level layout and navigation between calendar, analytics, profile, and about views.",
  "frontend/src/components/PhotoComparisonView.tsx": "Shows side‑by‑side photo comparisons for three selectable dates with variance and offset calculations.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile creation, capturing name, gender, and unit preferences.",
  "frontend/src/components/ProfileView.tsx": "React profile settings form allowing users to view and update personal info and units, using II login and React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login and clear functions.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend calls for profiles, entries, and mutations with cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles plus custom color variables, theming, and UI tweaks such as calendar dots and toast overrides.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/LoginPage.tsx": "UI page rendering the login screen with branding, feature highlights, and a login button wired to the Internet Identity hook.",
  "frontend/src/utils/cameraErrorMapping.ts": "Normalizes camera-related errors into consistent categories with user-friendly messages and blocking status.",
  "frontend/src/utils/cameraLensPreference.ts": "Attempts to select a standard rear camera lens using heuristics, with safeguards for Android Chrome PWAs and devices lacking labels.",
  "frontend/src/utils/pwa.ts": "Provides utilities to detect installed PWAs, Android Chrome environments, and their combination for special handling.",
  "frontend/src/utils/time.ts": "Utility functions for converting dates to/from backend nanosecond timestamps and formatting or comparing dates.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters, including support for hash‑based routing and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing versions, existing features, pending requests, and project details for enhancing border prominence in CalendarView."
}