{
  "backend/main.mo": "Motoko canister handling user profiles and daily entries with access control, storage mixins, and date-sorted compare functions.",
  "feature_evidence.json": "Feature evidence report listing modified frontend files for a glowing rainbow button update and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend components, hooks, and views across the app.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes with OKLCH color tokens.",
  "frontend/index.html": "HTML entry point loading the React app with dark mode class applied.",
  "frontend/src/App.tsx": "Main React app handling auth state, profile setup modal, and dark‑themed layout rendering with Toaster config.",
  "frontend/src/components/AboutView.tsx": "Static informational About page with cards explaining app features and a back button.",
  "frontend/src/components/AnalyticsView.tsx": "Analytics dashboard rendering multiple charts and workout heatmap using data from React Query hooks.",
  "frontend/src/components/CalendarView.tsx": "Renders the main calendar view, highlights days with saved entries, and opens day detail or photo comparison views.",
  "frontend/src/components/CameraCapture.tsx": "Handles camera access, lens preferences, zoom capabilities, and captures photos for entries.",
  "frontend/src/components/compare/CompareDatePickerModal.tsx": "Empty placeholder file for a compare date picker modal.",
  "frontend/src/components/compare/CompareSlotHeader.tsx": "Header component for comparison slots showing a date, relative day offset badge, and a button to open a calendar.",
  "frontend/src/components/DayDetailsInline.tsx": "Shows a compact inline summary of a day's measurements and workout data with variance indicators compared to today.",
  "frontend/src/components/DayDetailView.tsx": "Displays and edits a single day’s entry including photos, measurements, and workouts, with navigation and camera integration.",
  "frontend/src/components/MainLayout.tsx": "Provides the top-level app layout with navigation between calendar, analytics, profile, and about views.",
  "frontend/src/components/PhotoComparisonView.tsx": "Displays side‑by‑side photo comparisons across three selectable dates with variance and calendar selection support.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for creating a new user profile with name, gender, and unit selections, then saving via mutation.",
  "frontend/src/components/ProfileView.tsx": "Profile settings view allowing users to edit and save profile info and log out, using existing profile data.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity authentication, login flow, identity persistence, and related state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend calls for profiles, entries, and mutations with cache invalidation.",
  "frontend/src/index.css": "Configures Tailwind layers, defines extensive light/dark theme CSS variables, and adds utility styles for calendar indicators and toast overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/LoginPage.tsx": "Implements a styled login page with branding, feature highlights, and a button triggering Internet Identity login.",
  "frontend/src/utils/cameraErrorMapping.ts": "Normalizes various camera errors into consistent categories with user-friendly messages.",
  "frontend/src/utils/cameraLensPreference.ts": "Provides heuristics to select a standard rear camera lens, handling device lists, constraints, and PWA-specific limitations.",
  "frontend/src/utils/pwa.ts": "Detects PWA installation state and Android Chrome environment for special handling.",
  "frontend/src/utils/time.ts": "Offers utilities for converting dates to nanoseconds, formatting dates, and computing day variances and offsets.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, store, retrieve, and clear URL and session parameters, including hash‑based routing support and persistence logic.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, animations, container settings, and plugin usage for typography, container queries, and animations.",
  "project_state.json": "JSON file storing the project’s current state, including features, requests, metadata, and configuration for ongoing work."
}