{
  "backend/main.mo": "Motoko canister implementing the core backend: user profiles, daily fitness entries (photos, measurements, workouts), analytics helpers, and access-controlled CRUD operations using storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting a UI change to compact the non-editing Day Details overlay, listing affected frontend files, dependencies, test IDs, and confidence.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of all frontend files, describing each component’s responsibility, UI behavior, hooks, utilities, and styling conventions.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions using an OKLCH color system, enforcing dark mode styling, component tokens, and calendar indicator styles.",
  "frontend/index.html": "HTML entry point that forces dark mode via the root class and mounts the React app at the #root element.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, profile bootstrap, loading states, and enforcing a forced dark theme across the app.",
  "frontend/src/components/AnalyticsView.tsx": "Analytics dashboard showing weight trends, rolling averages, workout stats, and a 90-day workout heatmap, respecting user unit preferences.",
  "frontend/src/components/CalendarView.tsx": "Fullscreen calendar view that highlights days with saved content, opens day detail and photo comparison modals, and manages date navigation.",
  "frontend/src/components/CameraCapture.tsx": "Implements a full-screen camera capture UI using a custom useCamera hook, handling camera startup, errors, lens preferences, zoom capabilities, and photo capture. Returns captured images as ExternalBlob objects and includes UX messaging for camera constraints and PWA quirks.",
  "frontend/src/components/DayDetailView.tsx": "Displays and edits a single day's body tracking entry, including measurements, workouts, and an optional progress photo. Integrates camera capture, photo upload, and save logic tied to backend DailyEntry mutations.",
  "frontend/src/components/MainLayout.tsx": "Provides the main application shell with header, footer, and navigation between Calendar, Analytics, and Profile views. Manages active view state and renders the corresponding top-level component.",
  "frontend/src/components/PhotoComparisonView.tsx": "Shows a modal for comparing progress photos from different days (e.g., Day 1, 30, 90) either side-by-side or overlaid. Fetches comparison images via a query hook and supports toggling display mode.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal wizard for initial user profile creation, collecting name, age, gender, and unit preferences. Persists the profile via a backend mutation and validates required fields with toast feedback.",
  "frontend/src/components/ProfileView.tsx": "Profile settings page allowing users to view and update personal details, units, and gender, and to log out. Syncs profile data with backend queries and mutations and clears client state on logout.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and caches a backend actor using React Query, handling authenticated vs anonymous identities. It recreates the actor on identity change and invalidates/refetches dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login, logout, persisted identities, and login status via AuthClient. Exposes a hook for accessing the current identity and authentication actions throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines a set of React Query hooks and mutations for interacting with backend actor methods (profiles, entries, measurements, workouts). Each hook depends on useActor and handles cache invalidation on successful mutations.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, and base styles. Includes custom styles for calendar day indicators showing saved content.",
  "frontend/src/main.tsx": "Application entry point that renders the React app, wiring up React Query and Internet Identity providers. Imports global styles and mounts the App component.",
  "frontend/src/pages/LoginPage.tsx": "Renders the marketing-style login page with feature highlights and a call-to-action to sign in using Internet Identity. Uses authentication state to reflect login progress.",
  "frontend/src/utils/cameraErrorMapping.ts": "Utility that normalizes camera-related errors into consistent, user-friendly error objects. Maps DOMException names and custom error types to categories with messages and blocking flags.",
  "frontend/src/utils/cameraLensPreference.ts": "Provides a best-effort utility to prefer the standard rear camera lens over ultrawide/fisheye by inspecting media device labels and applying video track constraints, with safeguards and skips for unsupported cases like Android Chrome PWAs.",
  "frontend/src/utils/pwa.ts": "Defines helper functions to detect installed PWAs, Android Chrome browsers, and the specific Android Chrome PWA environment to gate platform-specific behavior.",
  "frontend/src/utils/urlParams.ts": "Implements utilities for reading URL parameters from query strings or hash routes, persisting them in sessionStorage, and cleaning sensitive parameters from the URL without page reloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode behavior, content paths, container settings, extended theme tokens (colors, radius, animations), and registering typography, container query, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, including a high-level app summary and a versioned list of existing features spanning authentication, access control, profiles, and fitness journaling functionality."
}