{
  "backend/main.mo": "Motoko canister implementing user profiles and daily fitness entries with access control, storage mixins, and comparison helpers.",
  "feature_evidence.json": "Feature evidence report describing a frontend change to replace one login-page image with a new asset.",
  "frontend-file-summaries.txt": "Preexisting summaries of multiple frontend files describing their roles in the app’s UI, logic, and data flow.",
  "frontend/index.css": "Tailwind base/theme definitions customizing OKLCH color variables for light/dark modes.",
  "frontend/index.html": "HTML entry point loading the React app with dark mode enabled on the root element.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile-loading flow, theme setup, and routing between login and main layout.",
  "frontend/src/components/AboutView.tsx": "Static informational view describing the app’s purpose and features with navigational back button.",
  "frontend/src/components/AnalyticsView.tsx": "Analytics dashboard rendering charts for weight, body fat, measurements, workout duration, and activity frequency using data query hooks.",
  "frontend/src/components/CalendarView.tsx": "Renders the main calendar view, tracks selected dates, and opens day detail or photo comparison views with saved-entry indicators.",
  "frontend/src/components/CameraCapture.tsx": "Provides a camera interface with lens preference, zoom handling, and photo capture, managing errors and device capabilities.",
  "frontend/src/components/compare/CompareDatePickerModal.tsx": "Empty or placeholder file for a date picker modal used in comparison views.",
  "frontend/src/components/compare/CompareSlotHeader.tsx": "Header component showing a selected date, its offset from today, and a button to change it with slot-specific styling.",
  "frontend/src/components/DayDetailsInline.tsx": "Shows a compact summary of a day's stats with variance vs. today, using user unit preferences and existing entry data.",
  "frontend/src/components/DayDetailView.tsx": "Displays and edits a day's entry including photo, measurements, and workouts, with navigation and camera/upload support.",
  "frontend/src/components/MainLayout.tsx": "Defines the app’s top-level layout and navigation between calendar, analytics, profile, and about views.",
  "frontend/src/components/PhotoComparisonView.tsx": "Displays side‑by‑side photo comparison across three dates with variance indicators and date selection calendars.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for creating a new user profile, handling name, gender, and unit selection, then saving via mutation.",
  "frontend/src/components/ProfileView.tsx": "Profile settings page allowing users to view and update profile fields and logout.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, storing identity state, and exposing login/logout utilities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend calls for profiles, entries, and mutations with cache invalidation.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables plus styles for calendar dot indicators.",
  "frontend/src/main.tsx": "Initializes React root, sets up React Query and Internet Identity provider, and renders the app.",
  "frontend/src/pages/LoginPage.tsx": "Login screen with image carousel supporting swipe, mouse drag, and wheel navigation, integrating Internet Identity login.",
  "frontend/src/utils/cameraErrorMapping.ts": "Maps browser camera errors to normalized types with user-friendly messages and blocking indicators.",
  "frontend/src/utils/cameraLensPreference.ts": "Heuristically selects a standard rear camera lens when possible, avoiding problematic environments like Android Chrome PWAs.",
  "frontend/src/utils/pwa.ts": "Provides utilities to detect installed PWAs, Android Chrome environments, and their combination.",
  "frontend/src/utils/time.ts": "Utility functions for converting dates to backend time, formatting dates, and calculating day variances and offsets.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and remove them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including feature requests to replace a signup-page gallery image and add a new static asset."
}