{
  "backend/main.mo": "Motoko canister defining core data models (user profiles, daily entries, measurements, workouts) and CRUD/query APIs with date-based sorting, persistent storage, and access control via authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting three UI redesign features for the Progress Comparison slot header, mapping requirements to frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Generated overview mapping key frontend source files to concise descriptions of their responsibilities across app layout, views, hooks, utilities, and styling.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions implementing the app’s forced dark theme, OKLCH color tokens, chart colors, and shared base styles.",
  "frontend/index.html": "HTML entry point that enforces dark mode, defines the root mount element, and loads the React application bundle.",
  "frontend/src/App.tsx": "Root React component handling authentication flow, profile setup gating, forced dark theme provisioning, and global toast configuration.",
  "frontend/src/components/AboutView.tsx": "Static informational view describing the physiq app’s purpose and features, with card-based sections and a back navigation button.",
  "frontend/src/components/AnalyticsView.tsx": "Displays analytics dashboards including weight trends with rolling averages, workout heatmap for the last 90 days, and summary stat cards using data from query hooks.",
  "frontend/src/components/CalendarView.tsx": "Renders a full-screen calendar highlighting days with saved entries and opens day detail or photo comparison modals based on user interaction.",
  "frontend/src/components/CameraCapture.tsx": "Provides an in-app camera interface for capturing photos with error handling, lens preference logic, zoom controls, and PWA-specific optimizations.",
  "frontend/src/components/compare/CompareDatePickerModal.tsx": "Empty or placeholder file intended for a modal that lets users pick dates for comparison slots.",
  "frontend/src/components/compare/CompareSlotHeader.tsx": "UI header component for a comparison slot showing the selected date, variance badge with tooltip, and a button to open a calendar picker.",
  "frontend/src/components/DayDetailView.tsx": "Shows and edits a single day’s entry, allowing users to add measurements, workouts, and photos via camera or upload, and save them to the backend.",
  "frontend/src/components/MainLayout.tsx": "Defines the main application layout with header navigation, footer, and conditional rendering of calendar, analytics, profile, and about views.",
  "frontend/src/components/PhotoComparisonView.tsx": "Enables side-by-side comparison of progress photos from three selected dates with calendar selection, date variance indicators, and image controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component that collects initial user profile data (name, age, gender, unit preferences) and saves it via a mutation, showing toast feedback on success or failure.",
  "frontend/src/components/ProfileView.tsx": "Profile settings page that displays and edits the current user profile, allows saving updates, and supports logging out while syncing state with React Query.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook managing Internet Identity authentication, including login, logout, identity persistence, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, daily entries, measurements, workouts, and comparison data through the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines extensive CSS variables for light/dark themes, charts, and sidebar colors. Includes global base styles, calendar day dot indicators, and dark-theme overrides for toast notifications.",
  "frontend/src/main.tsx": "Frontend entry point that creates the React root and renders the App wrapped with React Query and Internet Identity providers, importing global styles.",
  "frontend/src/pages/LoginPage.tsx": "Implements the marketing-style login page with branding, feature highlights, and a login call-to-action using Internet Identity. Uses Tailwind styling and iconography for a two-column hero layout.",
  "frontend/src/utils/cameraErrorMapping.ts": "Provides utilities to normalize camera-related errors into consistent types, user-friendly messages, and blocking flags. Maps both custom hook errors and browser DOMException cases.",
  "frontend/src/utils/cameraLensPreference.ts": "Best-effort utility to prefer a standard rear camera lens over ultrawide using device enumeration and heuristics. Safely skips or falls back in unsupported cases, including Android Chrome PWAs.",
  "frontend/src/utils/pwa.ts": "Environment detection helpers to identify installed PWAs, Android Chrome browsers, and the specific Android Chrome PWA combination for conditional behavior.",
  "frontend/src/utils/time.ts": "Collection of date/time utilities for converting between JS Date and backend nanosecond Time, normalizing to start-of-day, and formatting or calculating day offsets and variances.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query strings or hash-based routing, persist them in sessionStorage, and retrieve or clear them with URL taking precedence. Includes logic to safely remove sensitive parameters from the URL hash without reloading the page.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, container defaults, extended color system via CSS variables, custom radii, shadows, and animations. Registers typography, container queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current scope and features, including a high-level product summary and a versioned list of implemented features with descriptions and metadata. Used to track project state and existing functionality for planning."
}