{
  "kind": "build_request",
  "title": "Make selected button border thicker, brighter, and animated rainbow glow",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update only the button at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[2]/div[1]/button[1] so its border is more prominent by making the glowing border effect thicker and brighter, changing the glow to a rainbow spectrum, and ensuring the glow is visibly animated while preserving the button’s existing size, layout, and click behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make this button's border more prominent",
          "1. both",
          "2. can you make it a rainbow/glow colour",
          "3. currently there is no animation the button is very basic"
        ]
      },
      "acceptanceCriteria": [
        "The selected button displays a clearly thicker border effect than before (more than the current subtle outline).",
        "The border/glow uses a rainbow gradient (multiple distinct hues across the spectrum), not just a blue/purple gradient.",
        "The glow is visibly animated (e.g., continuous rotation/pulse) under normal motion settings.",
        "The button’s dimensions and layout do not change (no content shift or resize due to the glow).",
        "The button remains fully clickable and behaves exactly as before (same onClick, disabled behavior preserved).",
        "When the button is disabled, the glow effect is subdued and does not animate.",
        "When the user has prefers-reduced-motion enabled, the animation is disabled while keeping a static rainbow glow."
      ]
    }
  ],
  "constraints": [
    "Apply the styling change ONLY to the selected button at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[2]/div[1]/button[1] (do not change other buttons).",
    "Do not edit files under frontend/src/components/ui (compose via classes/CSS instead).",
    "Frontend changes only; no backend changes are required."
  ],
  "nonGoals": [
    "Redesigning the login page layout or changing any button text/copy.",
    "Changing authentication flow or login behavior.",
    "Adding new pages, navigation, or features unrelated to the selected button styling."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}