{
  "kind": "build_request",
  "title": "Add rotating subtle animated glowing border to the selected button",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Apply a subtle animated glowing border that continuously rotates around the border of the button located at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[1]/div[1]/div[2]/button[1], creating a “live / waiting to be pressed” effect while preserving the button’s existing size, layout, and click behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can you give this button's border a subtle glowing colour that tourns around the border, like a live button waiting to be pressed"
        ]
      },
      "acceptanceCriteria": [
        "The selected button displays a subtle glowing border effect with a visibly rotating highlight moving around the perimeter.",
        "The effect does not change the button’s dimensions or cause layout shift (no jittering or reflow).",
        "The effect is visible in both light and dark themes and remains subtle (not overpowering surrounding UI).",
        "Hover/active/disabled states continue to work; when disabled, the glow is either removed or significantly subdued so the disabled state is still clear.",
        "If the user has reduced-motion enabled (prefers-reduced-motion), the border animation is disabled (static border/glow is acceptable).",
        "The change is applied only to the selected button, not globally to all buttons."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only shadcn UI components).",
    "Keep the backend unchanged (no Motoko changes required)."
  ],
  "nonGoals": [
    "Adding the same animated glow border to other buttons across the app.",
    "Changing the button text, icon, routing/navigation behavior, or button placement/layout."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}