{
  "kind": "build_request",
  "title": "Make CalendarView button and calendar borders slightly more prominent",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Increase the border prominence (slightly thicker and more visually distinct, while staying consistent with the existing theme) for ONLY the selected 'Compare Progress' outline button at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[1]/div[1]/div[2]/button[1] (implemented in CalendarView).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make the borders of this button and the calendar slightly more prominent"
        ]
      },
      "acceptanceCriteria": [
        "On the Calendar page, the 'Compare Progress' button’s border is visibly more prominent than before (e.g., thicker than the default outline border).",
        "Only the selected 'Compare Progress' button’s border styling is changed; other buttons across the app are unaffected.",
        "The button remains an outline-style button and remains readable in both light and dark themes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Increase the border prominence (slightly thicker and more visually distinct, while staying consistent with the existing theme) for ONLY the selected main calendar element at XPath /html[1]/body[1]/div[1]/div[1]/main[1]/div[1]/div[1]/div[2]/div[1]/div[1] (the fullscreen calendar container/component in CalendarView).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make the borders of this button and the calendar slightly more prominent"
        ]
      },
      "acceptanceCriteria": [
        "On the Calendar page, the calendar’s outer border is visibly more prominent than before (e.g., thicker than the default 1px border).",
        "Only the selected calendar element’s border styling is changed; other calendar instances (e.g., comparison date picker calendar) are unaffected.",
        "The calendar border remains consistent with the app’s existing border color tokens and looks correct in both light and dark themes."
      ]
    }
  ],
  "constraints": [
    "Apply changes ONLY to the two elements identified by the provided XPaths; do not modify border styling globally (e.g., do not change shared Button/Calendar component defaults).",
    "Do not edit any files under frontend/src/components/ui (read-only components)."
  ],
  "nonGoals": [
    "No backend changes.",
    "No layout, spacing, or typography redesign beyond what is necessary to make the two borders slightly more prominent.",
    "No changes to comparison view card borders or other borders elsewhere in the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}