{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rotating subtle glowing border on the LoginPage primary button",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a subtle rotating glowing border animation to only the specified LoginPage button without affecting layout, behavior, or other buttons, including reduced-motion and disabled handling.",
      "acceptanceCriteria": [
        "The selected button displays a subtle glowing border effect with a visibly rotating highlight moving around the perimeter.",
        "The effect does not change the button’s dimensions or cause layout shift (no jittering or reflow).",
        "The effect is visible in both light and dark themes and remains subtle (not overpowering surrounding UI).",
        "Hover/active/disabled states continue to work; when disabled, the glow is either removed or significantly subdued so the disabled state is still clear.",
        "If the user has reduced-motion enabled (prefers-reduced-motion), the border animation is disabled (static border/glow is acceptable).",
        "The change is applied only to the selected button, not globally to all buttons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Apply a dedicated, single-use className (e.g., \"live-glow-border\") to the existing Shadcn Button used for Sign In, ensuring it targets only this button and does not alter existing sizing/layout/click behavior."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Implement the rotating subtle glow border styles scoped to the new button class using pseudo-elements (absolute-positioned, pointer-events:none, border-radius:inherit) and a conic-gradient highlight with a rotation animation; include a prefers-reduced-motion media query to disable animation (static glow allowed) and disabled-state styles to remove/subdue the glow so disabled remains clearly disabled, while keeping the effect subtle in both light and dark themes."
        }
      ]
    }
  ]
}