{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 11,
  "summary": "physiq is a privacy-focused body transformation tracker built as a React + TypeScript single-page app backed by a Motoko canister on the Internet Computer (ICP). Users authenticate with Internet Identity, create and manage a personal profile (including unit preferences), and record per-day entries containing an optional progress photo (captured in-app or uploaded), optional weight and body measurements (chest/waist/hips), and optional workout logs (muscle groups + duration). The UI is calendar-driven with indicators for days that have saved content, includes an immersive full-screen day viewer/editor with swipe/keyboard navigation and Today-relative day variance, provides a three-slot progress photo comparison experience with per-slot date pickers and defaults (60 days back, 90 days back, today), and includes an analytics dashboard with weight trend charts (plus 7/30-day rolling averages) and a 90-day workout frequency heatmap. The backend enforces role-based access control bootstrapped via an admin token and includes Caffeine blob-storage maintenance/admin endpoints.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication with persisted delegation",
      "synonyms": [
        "II auth",
        "AuthClient login",
        "Delegation persistence"
      ],
      "description": "Provides an InternetIdentityProvider wrapping @dfinity/auth-client that restores stored identities on load, supports login via a configured identity provider/derivation origin, and exposes detailed login-status flags plus logout/clear.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Branded login/landing page with secure sign-in CTA",
      "synonyms": [
        "LoginPage",
        "Sign in screen"
      ],
      "description": "Displays a marketing-style landing page with feature highlights and a single Internet Identity login button with loading state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secure secret token handling via URL hash with session persistence and URL cleanup",
      "synonyms": [
        "Hash secret handling",
        "Admin token extraction",
        "getSecretParameter"
      ],
      "description": "Extracts sensitive parameters from the URL hash fragment, persists them in sessionStorage, and removes them from the URL via history.replaceState to reduce leakage (used for access-control bootstrap).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Typed backend actor creation per identity with access-control initialization",
      "synonyms": [
        "useActor",
        "Actor recreation on identity change"
      ],
      "description": "Creates a typed ICP canister actor using the current identity (or an anonymous actor when logged out). On authenticated actor creation, calls backend access-control initialization using a provided secret and then invalidates/refetches React Query caches.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "React Query data layer for profile, entries, analytics, and comparison",
      "synonyms": [
        "useQueries hooks",
        "Client-side caching",
        "Query invalidation"
      ],
      "description": "Encapsulates backend calls in React Query hooks for profile fetch/save, daily entry CRUD/listing, derived weight/workout lists for analytics, and a parameterized three-target comparison query. Mutations invalidate relevant query keys to keep views consistent.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Forced dark theme with global toast notifications",
      "synonyms": [
        "ThemeProvider dark",
        "Sonner toaster"
      ],
      "description": "Forces dark mode via next-themes across all app states and configures Sonner toasts with OKLCH token-based styling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "First-login profile onboarding modal",
      "synonyms": [
        "ProfileSetupModal",
        "Onboarding"
      ],
      "description": "When an authenticated user has no stored profile, displays a modal to collect name/age/gender and unit preferences, then persists the profile via the backend with toast feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Profile settings view (edit + save + logout)",
      "synonyms": [
        "ProfileView",
        "Account settings"
      ],
      "description": "Allows users to edit profile fields and unit preferences, save updates, and logout (clearing the Internet Identity session and React Query cache) with toast feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Main layout with header navigation and About back-stack behavior",
      "synonyms": [
        "MainLayout",
        "View switching"
      ],
      "description": "Provides an authenticated layout with header navigation between calendar, analytics, profile, and about views, preserving the prior view when entering/exiting About.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "About view",
      "synonyms": [
        "AboutView",
        "Info page"
      ],
      "description": "Displays in-app informational content describing the app’s purpose and key capabilities, with a Back action to return to the previous view.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Calendar journey view with saved-content indicators and day selection",
      "synonyms": [
        "CalendarView",
        "Entry markers",
        "Day tile dot indicator"
      ],
      "description": "Shows a monthly calendar, marks days with any saved content (photo/measurements/workouts), opens a day detail view on selection, and can launch the progress comparison modal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Full-screen day photo viewer with overlays and compact day details",
      "synonyms": [
        "DayDetailView",
        "Immersive entry viewer"
      ],
      "description": "Displays a photo-first full-screen view for a selected date with overlays (formatted date plus Today-relative day variance label) and a compact details panel showing logged measurements and workout info.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Day navigation via buttons, swipe gestures, and keyboard shortcuts",
      "synonyms": [
        "Swipe navigation",
        "Arrow key navigation"
      ],
      "description": "Within the day detail view, users can navigate adjacent days via chevrons, horizontal touch swipes, and keyboard shortcuts (ArrowLeft/ArrowRight/Escape).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Inline day entry editor for measurements, workouts, and photos",
      "synonyms": [
        "Entry editor",
        "Bottom-sheet editor"
      ],
      "description": "Provides an inline editor overlay for setting optional weight/chest/waist/hips measurements, optional workout info, and photo actions; persists as a daily entry via createOrUpdateEntry.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "In-app camera capture modal with zoom, lens preference, and PWA recovery handling",
      "synonyms": [
        "CameraCapture",
        "useCamera",
        "Hardened camera UX"
      ],
      "description": "Implements camera start/stop lifecycle with cleanup, capture-to-canvas, facing-mode switching, retry flows, defensive zoom initialization, lens preference heuristics, normalized errors, and Android Chrome PWA-specific recovery guidance/restarts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Progress photo upload for daily entries",
      "synonyms": [
        "File upload",
        "Image import"
      ],
      "description": "Allows uploading an image file, converts it to an ExternalBlob from bytes, previews via a direct blob URL, and saves it as part of the daily entry.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Progress comparison modal with three selectable targets and side-by-side/overlay modes",
      "synonyms": [
        "PhotoComparisonView",
        "Milestone comparison",
        "Overlay comparison"
      ],
      "description": "Compares up to three progress photos using three independently selectable target dates, supporting a three-column side-by-side view, an overlay mode, and an inline calendar picker flow for selecting slot dates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Default Compare Progress slot dates (60d back / 90d back / today) with per-slot overrides",
      "synonyms": [
        "Compare defaults",
        "Three-slot default targets"
      ],
      "description": "On first opening the comparison view, initializes slot targets to 60 days back (Option 1), 90 days back (Option 2), and today (Option 3), while preserving the existing per-slot date override behavior via the date picker.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Comparison slot header UI with visible Today-relative variance indicator",
      "synonyms": [
        "CompareSlotHeader",
        "Option banner",
        "Variance badge"
      ],
      "description": "Renders each comparison slot header with an 'Option N' banner, selected date text, and an always-visible clock-icon variance badge (e.g. “-30d”, “0d”, “+5d”) computed relative to Today, plus an inline Change button to open a calendar.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Analytics dashboard with weight charts, rolling averages, and workout heatmap",
      "synonyms": [
        "AnalyticsView",
        "Weight trends",
        "Workout frequency heatmap"
      ],
      "description": "Displays stat cards, a weight progress line chart, 7/30-day rolling averages, and a 90-day workout frequency heatmap. Uses the user’s profile weight unit for axis labeling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Time/date utilities for nanosecond timestamps and day offset/variance formatting",
      "synonyms": [
        "dateToTime",
        "timeToDate",
        "resetToStartOfDay",
        "calculateDayOffsetFromToday"
      ],
      "description": "Provides BigInt-safe Date↔Time (ns) conversion, local start-of-day normalization, and day variance/offset computations and compact formatting used across calendar, day detail, and comparison views.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Backend role-based access control with admin bootstrap token",
      "synonyms": [
        "AccessControl",
        "Authorization mixin",
        "Admin bootstrap"
      ],
      "description": "Motoko access-control layer assigns roles per principal; the first eligible caller can become admin by providing the correct token, others become users. Exposes APIs to query role, check admin status, and assign roles (admin-only).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Backend caller-scoped user profile storage",
      "synonyms": [
        "UserProfile CRUD",
        "Units preferences"
      ],
      "description": "Motoko backend supports fetching and saving the caller’s profile with permission checks; admins can query other users’ profiles via a dedicated endpoint.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Backend caller-scoped daily entry CRUD and listing",
      "synonyms": [
        "DailyEntry persistence",
        "Journal entries"
      ],
      "description": "Motoko backend stores daily entries per principal and supports create/update by date, fetch by date, delete by date, and list all entries sorted by date. Entries include optional image, measurements, and workouts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Backend comparison selection for three arbitrary targets (closest on-or-before target)",
      "synonyms": [
        "getComparisonEntries",
        "Closest entry selection"
      ],
      "description": "For each target timestamp, selects the closest available entry on or before the target date (never after), enabling deterministic milestone comparisons.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Backend analytics helper endpoints for weights and workouts",
      "synonyms": [
        "getWeightEntries",
        "getWorkoutEntries"
      ],
      "description": "Provides derived lists of weight measurements and workouts sorted by date for analytics visualizations in the frontend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Caffeine blob-storage maintenance/admin endpoints",
      "synonyms": [
        "Storage mixin",
        "Dead blob pruning",
        "Gateway authorization refresh",
        "Cashier cycle refill"
      ],
      "description": "Exposes blob-storage operations to refresh authorized gateway principals, check blob liveness, list dead blobs for authorized callers, confirm deletion and trigger GC, create an upload certificate stub, and allow the cashier canister to top up cycles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-default-compare-progress-slot-targets-so-that-when-the-progress-comparison-modal-opens-slot-1-defaults-to-60-days-back-slot-2-defaults-to-30-days-back-replacing-the-prior-90-days-back-default-and-slot-3-defaults-to-today",
      "title": "Update the default Compare Progress slot targets so that when the Progress Comparison modal opens, Slot 1 defaults to 60 days back, Slot 2 defaults to 30 days back (replacing the prior 90-days-back default), and Slot 3 defaults to Today.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Update default Compare Progress slot targets/labels to: Option 1 = 60 days back, Option 2 = 30 days back, Option 3 = Today (replace prior 90-days-back default).",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is a React SPA using @tanstack/react-query for server-state caching, mutations, and targeted query invalidation.",
    "Authentication is implemented as a React context provider wrapping @dfinity/auth-client, restoring persisted delegations and exposing granular login status flags.",
    "Backend access is encapsulated in a typed canister actor created per identity (useActor); on actor creation it calls an access-control initialization endpoint and refreshes React Query caches.",
    "UI styling is Tailwind CSS + shadcn/ui components with OKLCH design tokens; the app forces dark theme via next-themes.",
    "Camera functionality is modularized via a reusable useCamera hook and a CameraCapture modal with zoom detection, lens preference heuristics, normalized error mapping, and Android Chrome PWA-specific recovery paths.",
    "Motoko backend composes behavior via mixins (authorization + blob-storage) and stores caller-scoped domain data keyed by Principal.",
    "Time is modeled as nanoseconds (Time.Time) in Motoko; the frontend uses BigInt-safe Date↔Time utilities with local start-of-day normalization and day offset/variance helpers.",
    "Analytics visualizations are rendered client-side using Recharts for line charts and a computed 90-day heatmap grid.",
    "Comparison flow fetches up to three entries in a single parameterized query keyed by the three target timestamps.",
    "Environment variables are used for admin bootstrap (CAFFEINE_ADMIN_TOKEN) and blob-storage cashier principal configuration."
  ],
  "known_issues": [
    "Motoko state (profiles, entries, roles, and blob-storage authorized principals) is not stored in stable variables and there are no preupgrade/postupgrade hooks; canister upgrades will lose data/roles.",
    "Weight unit modeling is inconsistent: backend Measurement.unit supports only #cm/#inches, but the profile also tracks weight units (#kg/#lbs). Frontend currently saves weight measurements using the measurements unit instead of the weight unit.",
    "useGetCallerUserProfile runs even when logged out because an anonymous actor is still created; this can trigger backend traps/authorization errors in React Query while on the login screen.",
    "AnalyticsView converts nanosecond timestamps using Number(bigint) arithmetic (e.g., Number(entry.date) / 1_000_000), risking precision loss/overflow; should convert via BigInt division first or reuse timeToDate().",
    "ProfileView initializes form state from userProfile only on initial render; if the profile query resolves after mount, inputs may not reflect fetched values without synchronization.",
    "frontend/src/components/compare/CompareDatePickerModal.tsx is empty/placeholder while other code uses an inline calendar; this may confuse maintainers or indicate an incomplete refactor.",
    "CompareSlotHeader accepts a dayOffsetLabel prop but does not render it (unused prop / dead wiring).",
    "backend/blob-storage/Storage.mo uses env var key \"CAFFFEINE_STORAGE_CASHIER_PRINCIPAL\" (triple 'F'); misconfiguration will trap at runtime.",
    "Storage.refillCashier computes Nat.sub(currentBalance, reservedCycles), which can trap on Nat underflow if canister balance is below the reserved threshold.",
    "Two different global CSS files exist (frontend/index.css and frontend/src/index.css); only src/index.css is imported, but the duplicate file may cause confusion or divergence."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "physiq",
  "clarification_mode": "pro",
  "clarification_rounds": 0
}